Revit 2025 API
StoneBumpType Enumeration
 The enumerated type representing the permitted values for the asset property "StoneBump" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StoneBumpType
Public Enumeration StoneBumpType
public enum class StoneBumpType
type StoneBumpType
Members
Member name | Value | Description
None | 0
Polishedgranite | 1
Stonewall | 2
Glossymarble | 3
Custom | 4
See Also
Reference
Autodesk.Revit.DB.Visual Namespace